{"intents":[
    {"tag": "unknown",
        "patterns": "default - words that are unknown",
        "responses": "Maaf, saya tidak mengerti apa maksud anda :("
    },

    {"tag": "greetings",
        "patterns": ["halo", "hai", "hello", "hi", "hallo"],
        "responses": ["Halo! Apa yang bisa saya bantu hari ini?"]
    },

    {"tag": "introduction",
        "patterns": ["siapa nama kamu", "siapa kamu", "who are you", "what is your name", "kamu siapa"],
        "responses": ["Nama saya KokiQu, chatbot asisten memasak anda. Salam kenal!"]
    },

    {"tag": "thank you",
        "patterns": ["terima kasih", "makasih", "thank you", "thanks", "thx"],
        "responses": ["Sama-sama, saya senang bisa membantu!"]
    },

    {"tag": "goodbye",
        "patterns": ["selamat tinggal", "sampai jumpa", "goodbye", "bye bye", "daa"],
        "responses": ["Selamat tinggal, dan sampai jumpa!"]
    },

    {
        "tag": "tengkleng",
        "patterns": ["cara membuat tengkleng", "resep tengkleng", "bagaimana cara membuat tengkleng?"],
        "responses": [
            "Rendang merupakan salah satu hidangan khas Solo sejenis sup yang berbahan dasar daging dan tulang kambing.\nBerikut merupakan resep memasak tengkleng:\n\nBahan-bahan:\n- 500 gram daging, iga, dan tulang kambing\n\nBumbu yang dihaluskan:\n- 15 butir bawang merah\n- 7 siung bawang putih\n- 1/2 butir kemiri\n- 1 sdt ketumbar\n- 1/2 butir pala\n- 1/2 sdt lada bubuk\n- 5 buah cabai rawit\n- 4 cm kunyit\n\nBahan pelengkap:\n- 1 ruas lengkuas (geprek)\n- 1/2 ruas jahe, geprek\n- 2 lembar daun salam\n- 2 batang serai (geprek)\n- 3 lembar daun jeruk (sobek)\n- 17 buah cabai rawit\n- 1 butir kapulaga\n- 2 butir cengkeh\n- garam dan gula secukupnya\n\nLangkah-langkah:\n1. Cuci bersih daging dan tulang kambing, kemudian rebus sampai empuk. Sisakan air rebusan untuk bahan kaldu./n2. Tumis bumbu halus dan bahan pelengkap (kecuali cabai rawit) sampai harum./n3. Masukkan daging kambing. Aduk rata.\n4. Tambahkan air kaldu sampai daging tenggelam. Tutup dan biarkan hingga bumbu meresap.\n5. Saat air mulai menyusut, tambahkan lagi air kaldu. Lakukan sampai semua air kaldu habis.\n6. Masukkan cabai rawit. Aduk dan koresi rasa. Masak kembali selama 10 menit.\n7. Setelah air mulai agak mengental dan daging empuk, angkat dan sajikan.\n"
        ]
    },
    {
        "tag": "nasi liwet solo",
        "patterns": ["cara membuat nasi liwet", "resep nasi liwet", "bagaimana cara membuat nasi liwet?"],
        "responses": [
            "Nasi liwet merupakan hidangan nasi khas Solo yang dimasak menggunakan santan kelapa dan bumbu rempah khas.\nBerikut merupakan resep memasak nasi liwet:\n\nBahan nasi liwet:\n- 4 cangkir beras\n- 2 helai daun pandan\n- 250 ml santan\n\nBahan sambal goreng:\n- 3 buah labu siam, kupas, dan serut kasar (memanjang)\n- 150 ml santan\n- Ebi secukupnya\n- 4 buah cabai merah besar\n- 3 siung bawang putih\n- 3 siung bawang merah\n- 2 biji kemiri\n- 1 batang serai (geprek)\n- 1 ruas lengkuas (geprek)\n\nBahan ayam kuning:\n- 1/2 kg dada ayam\n- 2 ruas kunyit\n- 1 batang serai\n- 3 siung bawang merah\n- 2 siung bawang putih\n- 150 ml santan\n- Minyak goreng secukupnya untuk menumis\n\nBahan areh putih:\n- 3 butir telur, ambil putihnya\n- 100 ml santan\n- Garam secukupnya\n\nLangkah-langkah:\n1. Cuci beras hingga bersih, masukkan santan dan air secukupnya. Campurkan sedikit garam, masukkan juga daun pandan. Tanak nasi liwet menggunakan rice cooker hingga matang.\n2. Untuk membuat ayam kuning, haluskan kunyit, bawang merah, bawang putih. Tumis bumbu dan daun serai hingga harum.\n3. Masukkan ayam ke dalam bumbu tumis, biarkan meresap sesaat. Tambahkan air, kemudian tunggu hingga mendidih, lalu masukkan santan, garam dan penyedap rasa. Biarkan hingga mendidih.\n4. Sedangkan untuk membuat sambal goreng, haluskan bawang merah, bawang putih, cabai merah besar, dan kemiri. Setelah halus tumis bumbu dengan daun serai, salam serta ebi. aduk hingga harum.\n5. Masukkan air dan garam secukupnya. Untuk rasa sambal goreng pada nasi liwet, rasanya lebih lembut dibandingkan dengan sambal goreng pada umumnya.\n6. Selanjutnya membuat areh putih, kocok putih telur hingga berbusa, lalu masukkan santan dan beri garam secukupnya. Kemudian masak areh menggunakan api kecil supaya tidak gosong.\n7. Untuk penyajian dapat menggunakan piring atau daun pisang yang dipincuk.\n8. Tata nasi pada picuk, berikan sambal goreng, ayam kuning yang sudah disuwir bersama dengan sayur labu siam, areh putih, dan tambahkan telur rebus.\n9. Nasi liwet siap untuk dihidangkan.\n"
        ]
    },
    {
        "tag": "timlo",
        "patterns": ["cara membuat timlo", "resep timlo", "bagaimana cara membuat timlo?"],
        "responses": [
            "Timlo merupakan makanan populer khas Solo seperti sup ayam yang kaya akan bumbu dan rempah-rempah. Hidangan ini biasanya disajikan panas dan ditemani dengan nasi putih.\nBerikut merupakan resep memasak timlo:\n\nBahan-bahan:\n- 1/2 kg daging ayam\n- 3 buah wortel potong menyerong\n- 1 keping bihun\n- 3 lembar jamur kuping\n- 1 batang daun bawang\n\nBumbu halus:\n- 2 siung bawang merah\n- 3 siung bawang putih\n- 3 biji kemiri\n- 1 sdt lada halus\n- 1 cm pala\n- Garam sekucupnya\n- Penyedap rasa secukupnya\n\nBumbu kuah:\n- Kaldu ayam\n- 3 lembar daun jeruk\n- 3 lembar daun bawang\n- 1 batang sereh geprek\n- 1 ruas jahe geprek\n\nBumbu adonan kriuk:\n- 1 butir telur\n- 4 sdm tepung terigu\n- Air secukupnya\n\nLangkah-langkah:\n1. Rebus daging ayam denga daun salam hingga mendidih.\n2. Rebus wotel, bihun, dan jamur kuping hingga empuk, lalu tiriskan, masing-masing pisahkan.\n3. Suwir daging ayam sudah di rebus tadi, dan potong juga daun bawang.\n4. Di wajan lain, tumis bumbu yang sudah dihaluskan serta tambahkan pula daun jeruk dan jahe. Tumis hingga mengeluarkan aroma harum.\n5. Selanjutnya masukkan kaldu ayam dan tambahkan air. Beri garam dan penyedap rasa secukupnya,lalu tunggu hingga mendidih.\n6. Untuk membuat adonan kriuk, kocok telur dengan tepung terigu tambahkan air dan garam secukupnya, aduk hingga sedikit encer.\n7. Panaskan teflon yang sudah diberi sedikit minyak goreng. Tuangkan adonan dengan takaran 1 sendok sayur, goreng hingga matang.\n8. Jika sudah matang lepaskan dari teflon, lalu gulung. Potong menjadi beberapa bagian.\n9. Goreng gulungan telur tersebut ke dalam minyak panas, doreng hingga warna kekuningan. Jika sudah amatang angkat dan tiriskan.\n10. Sajikan timlo dengan memasukkan sedikit bihun, wortel, jamur kuping dan suwiran ayam. Kemudian, tuangkan kuah ke dalamnya.\n"
        ]
    },
    {
        "tag": "sate kere",
        "patterns": ["cara membuat sate kere", "resep sate kere", "bagaimana cara membuat sate kere?"],
        "responses": [
            "Sate kere merupakan akanan khas yang berasal dari Solo, Jawa Tengah, Indonesia. Sate kere berbahan dasar tempe gembus atau tempe biasa.\nBerikut merupakan resep memasak sate kere:\n\nBahan-bahan:\n- 2 papan tempe gembus (bisa diganti tempe biasa)\n\nBumbu bacem:\n- 3 siung bawang putih\n- 3 siung bawang merah\n- 1/2 sdt ketumbar\n- 1 butir kemiri\n- 1 sdt kecap manis\n- 1 sdm gula merah\n- garam secukupnya\n- air secukupnya\n- 1 cm jahe\n\nBumbu kacang:\n- 100 gr kacang tanah, sangrai\n- 100 ml santan cair\n- 3 buah cabai keriting\n- 5 buah cabai rawit\n- 1 cm kencur\n- 3 siung bawang putih\n- garam, kecap dan gula secukupnya\n\nLangkah-langkah:\n1. Potong dadu tempe gembus. Haluskan bumbu bacem dan masukkan ke dalam panci. Masukkan tempe dan campur dengan bumbu. Tuang air secukupnya dan masak hingga tempe bacem matang.\n2. Haluskan kacang sangrai dengan semua bahan lainnya, tuang dengan santan hangat sedikit demi sedikit hingga menjadi saus kacang kental.\n3. Tusuk-tusuk tempe ke dalam tusukan sate, bakar sebentar dan tuang dengan bumbu kacang.\n4. Sate kere siap sajikan sebagai camilan atau lauk makan.\n"
        ]
        
        {
        "tag": "selat galantin",
        "patterns": ["cara membuat selat galantin", "resep selat galantin", "bagaimana cara membuat selat galantin?"],
        "responses": [
            "Selat Solo atau selat galantin merupakan makanan khas kota Solo yang terinspirasi hidangan dari Eropa, yaitu salad. Selat Solo merupakan makanan sejenis bistik daging dengan kuah manis encer khas Jawa.\nBerikut merupakan resep memasak selat galantin:\n\nBahan-bahan:\n- 1 kg daging sapi\n- 250 g tepung panir\n- 3 butir telur\n\nBumbu halus:\n- 8 siung bawang putih\n- 4 sdt garam\n- 1 sdt kaldu sapi bubuk\n- 1 sdm gula pasir\n- 1/4 butir pala\n- 1 sdm merica bubuk\n\nBahan kuah:\n\n- 800 ml air\n- 4 sdm gula merah\n- 3 sdm kecap manis\n- 1/4 butir pala utuh\n- 3 buah tomat potong-potong\n- 1 buah bawang bombay iris\n- 1 sdt maizena\n- Garam, gula, dan kaldu bubuk sapi secukupnya\n\nBumbu halus kuah:\n\n- 1 sdt merica bubuk\n- 5 siung bawang putih\n- 4 siung bawang merah\n- 4 siung bawang merah\n\nBahan pelengkap:\n- Sayur-sayuran (wortel rebus, bunci rebus, kentang goreng, selada)\n\nLangkah-langkah:\n1. Giling daging sapi hingga halus, campurkan dengan bumbu halus. Masukkan tepung panir dan telur, aduk rata lagi.\n2. Tuang ke dalam cetakan/loyang yang sudah dioles minyak agar nanti tidak menempel dan mudah dikeluarkan dari cetakan. Ratakan permukaannya sambil ditekan-tekan agar padat.\n3. Kukus selama kurang lebih 45 menit atau hingga matang. Angkat jika sudah dingin, potong-potong. Sisihkan.\n4. Buat kuahnya. Rebus air hingga mendidih. Tumis bumbu halus hingga matang, masukkan ke dalam kuah. Masak hingga sedap, angkat.\n5. Jika ingin kuahnya agak kental, larutkan 1 sdt maizena dengan 3 sdm air, tuang ke dalam kuah, aduk rata. Jika sudah mengental, angkat.\n6. Penyajiannya, tata daging beserta sayuran di piring lalu tuang dengan kuahnya.\n"
        ]
    },
{
        "tag": "sosis solo",
        "patterns": ["cara membuat sosis solo", "resep sosis solo", "bagaimana cara membuat sosis solo?"],
        "responses": [
            "Sosis Solo merupakan makanan khas kota Solo yang terbuat dari daging ayam atau sapi giling yang digulung dengan dadar telur.\nBerikut merupakan resep memasak sosis solo:\n\nBahan kulit:\n- 1 butir telur\n- 2 siung bawang putih, haluskan\n- 150 gr tepung terigu\n- 350 ml air\n- Garam dan merica bubuk secukupnya\n\nBahan isi:\n- 150 gr dada ayam, rebus suwir\n- 1 bungkus santan instan (65 ml), encerkan dengan air menjadi 130 ml.\n- Sedikit merica bubuk\n- Garam dan gula pasir secukupnya\n- 3 lbr daun jeruk\n\nBumbu halus:\n- ½ sdm ketumbar\n- 3 siung bawang putih\n- 2 butir kemiri\n\nLangkah-langkah:\n1. Tumis bumbu halus hingga harum, tambahkan daun jeruk.\n2. Masukkan daging ayam, tumis hingga bumbu meresap.\n3. Tuangkan santan secara bertahap. Ulangi hingga santan habis dan daging ayam kering. Gunakan api sedang cenderung kecil.\n4. Bumbui garam, merica dan gula. Koreksi rasa.\n5. Untuk membuat kulit sosis. Kocok telur dengan bawang putih, garam dan merica. Tuang air, aduk rata.\n6. Masukkan tepung sedikit demi sedikit, aduk rata hingga tidak bergerindil. Saring bila perlu.\n7. Dadar di atas teflon yang diolesi minyak menggunakan tisu dapur. Lakukan hingga adonan habis.\n8. Ambil selembar kulit sosis, beri isian lalu lipat dan rekatkan menggunakan larutan maizena.\n9. Goreng dengan minyak panas hingga kecokelatan. Tiriskan.\n10. Sajikan dengan cabai hijau.\n"
        ]
    },
{
        "tag": "serabi solo",
        "patterns": ["cara membuat serabi solo", "resep serabi solo", "bagaimana cara membuat serabi solo?"],
        "responses": [
            "Serabi Solo merupakan jajanan tradisional khas Solo yang terbuat dari tepung beras yang dicampur dengan santan.\nBerikut merupakan resep memasak serabi solo:\n\nBahan-bahan:\n- 300 gr tepung beras\n- 50 gr tepung tapioka\n- 250 gr gula pasir\n- 5 gr ragi instan\n- garam secukupnya\n- 500 ml santan hangat\n- 150 ml santan kental (panaskan)\n\nLangkah-langkah:\n1. Masukkan tepung beras, tapioka, gula pasir, ragi, garam dan 400 ml santan. Aduk hingga rata, kemudian diamkan selama 20 menit.\n2. Panaskan cetakan serabi, masukkan adonan ke dalam cetakan. Gunakan api sedang untuk memanaskannya.\n3. Jika adonan sudah agak matang, tuangkan 1 sendok sayur santan kental. Tutup lagi adonan dan tunggu hingga matang.\n4. Taburi topping seperti pisang, nangka, meses, atau keju.\n5. Angkat dan sajikan.\n"
        ]
    },
{
        "tag": "kupat tahu",
        "patterns": ["cara membuat kupat tahu", "resep kupat tahu", "bagaimana cara membuat kupat tahu?"],
        "responses": [
            "Kupat tahu atau tahu kupat adalah makanan khas Solo berbahan dasar kupat dan tahu yang disiram dengan kuah manis.\nBerikut merupakan resep memasak kupat tahu:\n\nBahan-bahan:\n- 2 buah ketupat\n- 100 g mie telur\n- 50 g tahu putih\n- 5 lembar kubis\n- 3 lembar daun jeruk\n- 1 batang seledri, iris tipis\n- cabai rawit secukupnya\n- potongan mentimun (pelengkap)\n\nBahan bakwan:\n- 10 sdm tepung terigu\n- 1 butir telur ayam\n- wortel, kubis dan daun bawang secukupnya\n- air secukupya\n- 1 siung bawang putih\n- garam dan kaldu bubuk secukupnya\n\nBahan kuah:\n- 400 ml air\n- 3 sdm gula merah\n- 3 siung bawang putih\n- 2 lembar daun jeruk, iris tipis\n- 1 sdt gula pasir\n- 1 sdt garam\n- kecap manis secukupnya\n\nLangkah-langkah:\n1. Pertama, buat bakwannya dahulu. Iris tipis sayuran, ulek halus bawang putih dan sedikit garam.\n2. Campurkan semua bahan dengan tepung terigu. Tuang air secukupnya seperti membuat adonan bakwan pada umumnya.\n3. Goreng bakwan hingga matang, tiriskan.\n4. Rebus air untuk kuah, masukkan semua bahan. Tes rasa jika sudah mendidih, rasanya cenderung manis tapi ada rasa gurihnya.\n5. Goreng tahu yang sudah dipotong dadu hingga matang, angkat. Rebus mie telur, tiriskan. Potong ketupat dan bakwan. Siram kubis dengan air mendidih.\n6. Tata ketupat, mie, bakwan dan tahu goreng di atas piring. Siram dengan kuah.\n"
        ]
    },
{
        "tag": "cabuk rambak",
        "patterns": ["cara membuat cabuk rambak", "resep cabuk rambak", "bagaimana cara membuat cabuk rambak?"],
        "responses": [
            "Cabuk rambak adalah kuliner tradisional khas solo yang terbuat dari kupat yang diiris tipis dan disajikan dengan saus wijen.\nBerikut merupakan resep memasak cabuk rambak:\n\nBahan-bahan:\n- 1/2 kg wijen putih\n- 3 sdm minyak sayur\n- 5 lembar daun jeruk purut (iris halus)\n\nBumbu halus:\n- 10 siung bawang putih\n- 10 butir kemiri\n- 3 cm kencur\n- 2 sdm gula pasir garam secukupnya\n\nPelengkap:\n- 4 buah ketupat (potong sesuai selera)\n- Karak secukupnya\n\nLangkah-langkah:\n1. Goreng wijen putih dengan sedikit minyak hingga baunya harum dan warnanya kekuningan, haluskan.\n2. Uleni wijen halus dengan bumbu halus dan irisan daun jeruk purut. Encerkan bumbu cabuk rambak secukupnya dengan air matang.\n3. Penyajian cabuk rambak, potong-potong ketupat, siram bumbu, dan beri kerupuk karak.\n"
        ]
    }
]}
